blog/《重构》重构技巧之重新组织函数.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" Norris" />
<link rel="stylesheet" href="https://jgkamat.gitlab.io/src/jgkamat.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb46a254">1. 1. Replace Temp with Query</a>
<ul>
<li><a href="#orga48bf3a">1.1. 它们只在函数里使用，因此会驱使你写出更长的函数</a></li>
<li><a href="#orgccd1e15">1.2. 局部变量会增大Extract Method的难度</a></li>
<li><a href="#org1711e90">1.3. 所谓的性能问题可以先不去管它，等真的出现性能问题再去优化</a></li>
</ul>
</li>
<li><a href="#org8b95462">2. Split Temporary Variable</a></li>
<li><a href="#org5898ede">3. Remove Assignments to Parameters</a></li>
<li><a href="#org00a1d8b">4. Replace Method with Method Object</a></li>
<li><a href="#org8065b55">5. </a></li>
</ul>
</div>
</div>
<blockquote>
<p>
只摘出来一些不看书不容易知道的重构方法，像Extract Method那些就不说了
</p>
</blockquote>

<div id="outline-container-orgb46a254" class="outline-2">
<h2 id="orgb46a254"><span class="section-number-2">1</span> 1. Replace Temp with Query</h2>
<div class="outline-text-2" id="text-1">
<p>
将临时变量的表达式提取到一个方法中，从而去掉临时变量。
临时变量的用处主要是对一些复杂的表达式做解释，但一般还是建议将表达式Extract Method出来, 只有当 <br />
表达式是拥有大量局部变量的算法时，Extract Method很难，才使用临时变量表示表达式
临时变量的问题：
</p>
</div>
<div id="outline-container-orga48bf3a" class="outline-3">
<h3 id="orga48bf3a"><span class="section-number-3">1.1</span> 它们只在函数里使用，因此会驱使你写出更长的函数</h3>
</div>
<div id="outline-container-orgccd1e15" class="outline-3">
<h3 id="orgccd1e15"><span class="section-number-3">1.2</span> 局部变量会增大Extract Method的难度</h3>
</div>
<div id="outline-container-org1711e90" class="outline-3">
<h3 id="org1711e90"><span class="section-number-3">1.3</span> 所谓的性能问题可以先不去管它，等真的出现性能问题再去优化</h3>
</div>
</div>

<div id="outline-container-org8b95462" class="outline-2">
<h2 id="org8b95462"><span class="section-number-2">2</span> Split Temporary Variable</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
分解临时变量
</p>
</blockquote>
<p>
只有当使用“循环变量”，如for循环，或者结果收集变量，如某个数组用于收集结果时，才可以将一个临时变量赋值多次
</p>
</div>
</div>

<div id="outline-container-org5898ede" class="outline-2">
<h2 id="org5898ede"><span class="section-number-2">3</span> Remove Assignments to Parameters</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
不要对参数赋值，因为降低了代码清晰度，混用了按值传递和按引用传递两种参数传递方式
</p>
</blockquote>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">method</span>(input)
  <span style="color: #F0DFAF; font-weight: bold;">if</span> a_condition
    input = <span style="color: #BFEBBF;">1</span>
  <span style="color: #F0DFAF; font-weight: bold;">else</span>
    input = <span style="color: #BFEBBF;">2</span>
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>
<p>
应当给设置一个临时变量，比如result，给这个变量赋值
</p>
</div>
</div>

<div id="outline-container-org00a1d8b" class="outline-2">
<h2 id="org00a1d8b"><span class="section-number-2">4</span> Replace Method with Method Object</h2>
<div class="outline-text-2" id="text-4">
<blockquote>
<p>
用函数对象取代函数
本质上是：当临时变量过多，无法使用Extract Method的时候，可以新建一个类，把临时变量变成另一个类的全局变量
</p>
</blockquote>
<p>
范例：只是一个简单的例子
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">A</span>
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">method</span>(arg1, arg2)
    temp1 = arg1 - arg2 + a_method
    temp2 = temp1 * <span style="color: #BFEBBF;">2</span> + arg1
    temp1 + temp2
  <span style="color: #F0DFAF; font-weight: bold;">end</span> 

  <span style="color: #DCDCCC; font-weight: bold;">private</span> 

  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">a_method</span>
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>
<p>
这只是一个简单情况，但我想Extract Method还是有些困难，因为临时变量较多，所以可以创建一个Temp的类，然后这些局部变量都会变成这个类的实例变量
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Temp</span>
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">initialize</span>(a_instance, arg1, arg2)
    <span style="color: #DFAF8F;">@a_instance</span> = a_instance
    <span style="color: #DFAF8F;">@arg1</span> = arg1
    <span style="color: #DFAF8F;">@arg2</span> = arg2
  <span style="color: #F0DFAF; font-weight: bold;">end</span>

  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">compute</span>
    <span style="color: #DFAF8F;">@temp1</span> = <span style="color: #DFAF8F;">@arg1</span> - <span style="color: #DFAF8F;">@arg2</span> + <span style="color: #DFAF8F;">@a_instance</span>.a_method
    <span style="color: #DFAF8F;">@temp2</span> = <span style="color: #DFAF8F;">@temp1</span> * <span style="color: #BFEBBF;">2</span> + <span style="color: #DFAF8F;">@arg1</span>
    <span style="color: #DFAF8F;">@temp1</span> + <span style="color: #DFAF8F;">@temp2</span>
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>

<span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">A</span>
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">method</span>(arg1, arg2)
    <span style="color: #7CB8BB;">Temp</span>.new(<span style="color: #F0DFAF; font-weight: bold;">self</span>, arg1, arg2).compute
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>

<p>
现在Temp类中之前的临时变量都变成全局变量了，就可以使用Extract Method
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Temp</span>
  <span style="color: #5F7F5F;">#</span><span style="color: #7F9F7F;">...</span>
  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">compute</span>
    temp1_method + temp2_method
  <span style="color: #F0DFAF; font-weight: bold;">end</span>

  <span style="color: #DCDCCC; font-weight: bold;">private</span>

  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">temp1_method</span>
    <span style="color: #DFAF8F;">@temp1</span> = <span style="color: #DFAF8F;">@arg1</span> - <span style="color: #DFAF8F;">@arg2</span> + <span style="color: #DFAF8F;">@a_instance</span>.a_method
  <span style="color: #F0DFAF; font-weight: bold;">end</span>

  <span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">temp2_method</span>
    <span style="color: #DFAF8F;">@temp1</span> * <span style="color: #BFEBBF;">2</span> + <span style="color: #DFAF8F;">@arg1</span>
  <span style="color: #F0DFAF; font-weight: bold;">end</span>
<span style="color: #F0DFAF; font-weight: bold;">end</span>
</pre>
</div>
<p>
大概就是这个意思
</p>
</div>
</div>

<div id="outline-container-org8065b55" class="outline-2">
<h2 id="org8065b55"><span class="section-number-2">5</span> </h2>
</div>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://gitlab.com/jgkamat/jgkamat.gitlab.io"> Norris</a></p>
<p class="date">Published: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.3.1)</p>
</div>
</div>
</body>
</html>
